uhnp/src/Documents/ЦессияДолжника/ЦессияДолжника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЦессияДолжника</name>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>InformationRegister.ВерсииГрафиковРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиФакт</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Цедент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Цессионарий</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСЦедентом</name>
    <type>
      <types>DefinedType.ДоговорДолжника</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСЦессионарием</name>
    <type>
      <types>DefinedType.ДоговорДолжника</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЦессияВходящая</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбязательства</name>
    <type>
      <types>EnumRef.ВидыОбязательств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТекущаяЗадолженность</name>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>DefinedType.ОбъектРасчетовУХ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементСтруктурыЗадолженности</name>
      <type>
        <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Enums/ЭлементыСтруктурыЗадолженности/ЭлементыСтруктурыЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭлементыСтруктурыЗадолженности</name>
  <enumValues>
    <name>ОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
  <enumValues>
    <name>Комиссии</name>
  </enumValues>
  <enumValues>
    <name>Штрафы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеКомиссии</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимостьАванс</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>УслугаПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойДолгКонтрагента</name>
    <comment>Основной долг контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыКонтрагента</name>
    <comment>Проценты контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>УслугаПоАрендеАванс</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыОбязательств/ВидыОбязательств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОбязательств</name>
  <enumValues>
    <name>ЗадолженностьПоДоговоруКуплиПродажи</name>
  </enumValues>
  <enumValues>
    <name>ЗадолженностьПоДоговоруЗайма</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокРасчетов</name>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказам</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговорамНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СтатусыДоговоровКонтрагентов/СтатусыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоговоровКонтрагентов</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ЦессияДолжника/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов    
	ОбщегоНазначенияУХ.УстановитьСостояниеДокумента(ЭтотОбъект);
	
	УправлениеФормой();
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ДоговорыКонтрагентов"
		И ОжиданиеНовогоДоговора Тогда 
		Объект.ДоговорСЦессионарием = Источник; 
		Модифицированность			= Истина;
		ОжиданиеНовогоДоговора		= Ложь;
		УправлениеФормой();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
    Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
         МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
         МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
    КонецЕсли;
    // Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ДоговорСЦедентомПриИзменении(Элемент)
	РассчитатьСуммуДокументаНаКлиенте()	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорСЦессионариемПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)

	Если НЕ Объект.ТекущаяЗадолженность.Количество() Тогда
		СтрокаТекущаяЗадолженность 			= Объект.ТекущаяЗадолженность.Добавить();
		СтрокаТекущаяЗадолженность.Сумма 	= Объект.СуммаДокумента;
		СтрокаТекущаяЗадолженность.ЭлементСтруктурыЗадолженности = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг");		
	ИначеЕсли  НЕ Элементы.ТекущаяЗадолженность.Видимость	Тогда
		Объект.ТекущаяЗадолженность[0].Сумма = Объект.СуммаДокумента;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбязательстваПриИзменении(Элемент)
	
	Объект.ДоговорСЦессионарием = Неопределено;
	Объект.ДоговорСЦедентом		= Неопределено;
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТекущаяЗадолженность
&НаКлиенте
Процедура ТекущаяЗадолженностьЭлементСтруктурыЗадолженностиПриИзменении(Элемент)
	СтрокаТекущаяЗадолженность = Элементы.ТекущаяЗадолженность.ТекущиеДанные;
	Если СтрокаТекущаяЗадолженность.Сумма = 0 Тогда 
		СтрокаТекущаяЗадолженность.Сумма = Объект.СуммаДокумента;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяЗадолженностьСуммаПриИзменении(Элемент)
	
	Объект.СуммаДокумента = Объект.ТекущаяЗадолженность.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДоговор(Команда)
	
	ОжиданиеНовогоДоговора = Истина;
	
	ПараметрыОснования = Новый Структура;
	ПараметрыОснования.Вставить("Владелец",				Объект.Цессионарий);
	ПараметрыОснования.Вставить("ВалютаВзаиморасчетов", Объект.ВалютаДокумента); 
	ПараметрыОснования.Вставить("Организация",			Объект.Организация);
	
	ПараметрыФормы  	= Новый Структура("ЗначенияЗаполнения",  ПараметрыОснования); 
	
	Если Объект.ВидОбязательства = ПредопределенноеЗначение("Перечисление.ВидыОбязательств.ЗадолженностьПоДоговоруКуплиПродажи") Тогда
		ВидДоговоровКонтрагентовУХ = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыДоговоровКонтрагентовУХ.СПоставщиком"); 
	Иначе	
		ВидДоговоровКонтрагентовУХ = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыДоговоровКонтрагентовУХ.ЗаемПолученный"); 
	КонецЕсли;	
	ПараметрыФормы.Вставить("Отбор", 		Новый Структура("ВидДоговораУХ", ВидДоговоровКонтрагентовУХ)); 
	ПараметрыФормы.Вставить("Основание", 	Объект.ДоговорСЦедентом);
	
	Если Объект.ВидОбязательства = ПредопределенноеЗначение("Перечисление.ВидыОбязательств.ЗадолженностьПоДоговоруКуплиПродажи") Тогда
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Справочник.ДоговорыКредитовИДепозитов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры 
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	ЭтоДолгПоставки 				= Объект.ВидОбязательства = ПредопределенноеЗначение("Перечисление.ВидыОбязательств.ЗадолженностьПоДоговоруКуплиПродажи");
	ДоговорПоЗаказамНакладным		= Ложь;
	Если ЭтоДолгПоставки
		 И ЗначениеЗаполнено(Объект.ДоговорСЦессионарием) Тогда 
		РеквизитыДоговораДолжника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДоговорСЦессионарием, "ПорядокРасчетов, ВидДоговораУХ");
		
		ДоговорПоЗаказамНакладным 		= (РеквизитыДоговораДолжника.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным")
		ИЛИ РеквизитыДоговораДолжника.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным") );
		
		Если РеквизитыДоговораДолжника.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным") Тогда
			Элементы.ТекущаяЗадолженностьОбъектРасчетов.ОграничениеТипа             = Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента");  
		Иначе	
			Элементы.ТекущаяЗадолженностьОбъектРасчетов.ОграничениеТипа             = Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг");  
		КонецЕсли; 
		
	КонецЕсли; 
	Элементы.ТекущаяЗадолженностьОбъектРасчетов.Видимость = ЭтоДолгПоставки И ДоговорПоЗаказамНакладным;
	Элементы.ТекущаяЗадолженностьЭлементСтруктурыЗадолженности.Видимость 	= НЕ ЭтоДолгПоставки; 
	Элементы.ТекущаяЗадолженность.Видимость									= НЕ ЭтоДолгПоставки 
																					ИЛИ ДоговорПоЗаказамНакладным;

	ТипОграничения 		= Новый Массив; 
	МассивПараметров 	= Новый Массив(); 
	
	Если НЕ ЭтоДолгПоставки Тогда
   		НовыйПараметр 	= Новый ПараметрВыбора("Отбор.ВидДоговораУХ", Справочники.ВидыДоговоровКонтрагентовУХ.ЗаемПолученный);
		МассивПараметров.Добавить(НовыйПараметр);				
       	МассивПараметров.Добавить(НовыйПараметр);
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Статус", Перечисления.СтатусыДоговоровКонтрагентов.Действует));
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления",Ложь));
		
		ТипОграничения.Добавить(Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"));
	Иначе
		НовыйПараметр 	= Новый ПараметрВыбора("Отбор.ВидДоговораУХ", Справочники.ВидыДоговоровКонтрагентовУХ.СПоставщиком);
		МассивПараметров.Добавить(НовыйПараметр);				
	    МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления",Ложь));
		
		ТипОграничения.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));	
	КонецЕсли;
	
	НовыеПараметры 	= Новый ФиксированныйМассив(МассивПараметров);
	Элементы.ДоговорСЦедентом.ПараметрыВыбора 		= НовыеПараметры;      
	Элементы.ДоговорСЦессионарием.ПараметрыВыбора 	= НовыеПараметры;	
	Элементы.ДоговорСЦедентом.ОграничениеТипа 		= Новый ОписаниеТипов(ТипОграничения);	   
	Элементы.ДоговорСЦессионарием.ОграничениеТипа 	= Новый ОписаниеТипов(ТипОграничения);	   
 
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СуммыОбязательств(Организация, Контрагент, ДоговорКонтрагента)
	Возврат ЦессииУХ.МассивКредиторскойЗадолженности(Организация, Контрагент, ДоговорКонтрагента);	
КонецФункции // ()

&НаКлиенте
Процедура РассчитатьСуммуДокументаНаКлиенте()
   	МассивОбязательств = СуммыОбязательств(Объект.Организация, Объект.Цедент, Объект.ДоговорСЦедентом);
	Объект.ТекущаяЗадолженность.Очистить(); 
	Для Каждого МассивЭлемент Из МассивОбязательств Цикл
	
		ЗаполнитьЗначенияСвойств(Объект.ТекущаяЗадолженность.Добавить(), МассивЭлемент);
	
	КонецЦикла;
	Объект.СуммаДокумента = Объект.ТекущаяЗадолженность.Итог("Сумма");

КонецПроцедуры

#КонецОбласти
